Revit 2027 API
Floor.Create Method
Overload List
Name | Description
Create(Document, IList<CurveLoop>, ElementId, ElementId) |  Creates a new instance of architectural floor within the project.
Create(Document, IList<CurveLoop>, ElementId, ElementId, Boolean, Line, Double) |  Creates a new instance of floor within the project.
Top
See Also
Reference
Floor Class
Autodesk.Revit.DB Namespace